<?php
return [
    'name' => 'Image',
    'version' => '1.0',
    'date' => '2017-03-01',
    'label' => 'Управления изображениями',

    /*
    |--------------------------------------------------------------------------
    | Место хранения записей об изображениях
    |--------------------------------------------------------------------------
    |
    | Здесь можно определить место хранения для записей об изображениях.
    | Доступны значения: "database" - база данных, "mongodb" - MongoDb
    |
    */
    'record' => env('IMAGE', 'mongodb'),

	/*
    |--------------------------------------------------------------------------
    | Драйвер хранения изображений
    |--------------------------------------------------------------------------
    |
    | Определяем систему хранения изображений.
	| base - в базе данных, local - локально в папке, ftp - через FTP протокол в папке
	| http - через HTTP протокол в папке
    |
    */
	'driver' => env('IMAGE_DRIVER', 'local'),


	/*
    |--------------------------------------------------------------------------
    | Настройка хранилищь для изображений
    |--------------------------------------------------------------------------
    |
    | В этом месте можно определить доступы к хранилищу изображений
    |
    */
	'store' =>
	[
		'base' =>
		[
		'table' => 'image',
		'property' => 'byte'
		],
		'local' =>
		[
		'path' => 'storage/app/public/images/',
		'pathSource' => storage_path('app/public/images/'),
		],
		'ftp' =>
		[
		'server' => 'weborobot.ru',
		'login' => 'weborobot',
		'password' => 'O4z1S0f6',
		'path' => 'www/images/'
		],
		'http' =>
		[
		'read' => 'http://loc.weborobot.ru/storage/app/public/images/',
		'create' => 'http://loc.weborobot.ru/img/create/',
		'update' => 'http://loc.weborobot.ru/img/update/',
		'destroy' => 'http://loc.weborobot.ru/img/destroy/',
		]
	],

	/*
    |--------------------------------------------------------------------------
    | Фильтр по умолчанию для изображений
    |--------------------------------------------------------------------------
    |
    | Определяем систему фильтрации изображений по умолчанию.
    |
    */
	'filter' => 'watermark',
];
