<h1>Тестовый сайт для вас</h1>

<p>Чисто апостериорным и исключительно опытным путем совершенно невозможно познание красоты: оно всегда априорно, по крайней мере, отчасти, хотя и имеет&nbsp;другой характер, чем априорно известные нам виды закона основания. Они касаются общей формы явления как такового, поскольку она обосновывает возможность познания вообще, относятся к общему.</p>

<p>Не знающему исключений&nbsp;<em>как&nbsp;</em>всего являющегося, и из этого познания вытекают математика и чистое естествознание, между тем как другой род априорного познания, делающий возможным изображение прекрасного, относится не к форме, а к содержанию явлений, не к&nbsp;<em>как,&nbsp;</em>а к&nbsp;<em>что&nbsp;</em>являющегося.</p>
